SM_для_EDT/src/Documents/впПриходТМЦ/впПриходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впПриходТМЦ</name>
  <basedOn>Document.впЗаявкаНаСнабжение</basedOn>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <registerRecords>AccumulationRegister.впТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.впТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.впЗаказПоставщику</types>
      <types>DocumentRef.впПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийПриходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОприходованиеБывшегоВУпотреблении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВБМ</name>
    <comment>rarus atyutyakin ФТ.ИМ.02.01</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/InformationRegisters/рарусШтрихкодыНоменклатуры/рарусШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/рарусСтатусыИмуществаНаСудне/рарусСтатусыИмуществаНаСудне.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусСтатусыИмуществаНаСудне</name>
  <comment>rarus makole</comment>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>ВыданоВПользование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованоБУ</name>
  </enumValues>
  <enumValues>
    <name>СписаноВРегУчете</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/впЗаказПоставщику/впЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаказПоставщику</name>
  <registerRecords>AccumulationRegister.впТоварыКПоступлению</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>рарусДопускаетсяТолеранс</name>
    <comment>ФТ.СНБ.02.07</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <comment>Табличная части только для отражения. Разбивка по судам в отдельном РС</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Судно</name>
      <type>
        <types>CatalogRef.vftСуда</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/впПриходТМЦ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ rarus atyutyakin 28.02.2021  [ФТ.ИМ.02.01]
	// Исключены движения по РН впТоварыНаСкладах
	//МеханизмыДокумента.Добавить("ТоварыНаСкладах");
	// -- rarus atyutyakin 28.02.2021
	МеханизмыДокумента.Добавить("ТоварыУслугиКПоступлению");
	
	// ++ rarus yukuzi 30.12.2020   // Снабжение ТОИР 2 Приоритет
	МеханизмыДокумента.Добавить("рарусТоварыЗаявокНаСнабжение");
	// -- rarus yukuzi 30.12.2020
	
	// ++ rarus makole 2021-01-21 [ФТ.ИМ.01.01]
	МеханизмыДокумента.Добавить("рарусИмущественныйУчет");
	// -- rarus makole 2021-01-21 

КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	// ++ rarus atyutyakin 02.03.2021  [ФТ.ИМ.02.01]
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, 
		"Подразделение, Дата, ВидОперации, Распоряжение, ДокументОснование, ОприходованиеБывшегоВУпотреблении");
	//Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Подразделение, Дата, Распоряжение, ДокументОснование, ОприходованиеБывшегоВУпотреблении");
	// -- rarus atyutyakin 02.03.2021
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("Подразделение", Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("Распоряжение", Реквизиты.Распоряжение);
	//Запрос.УстановитьПараметр("РаспоряжениеЗаполнено", ЗначениеЗаполнено(Реквизиты.Распоряжение));
	Запрос.УстановитьПараметр("ДокументОснование", Реквизиты.ДокументОснование);
	Запрос.УстановитьПараметр("Период", Реквизиты.Дата);
	// ++ rarus atyutyakin 02.03.2021  [ФТ.ИМ.02.01]
	ЭтоВидОперацииБезОбязательнойЗаявки = (Реквизиты.ВидОперации = рарусПриходТМЦ.ВидОперацииЗакупкаЧерезПодотчетноеЛицо()
		ИЛИ Реквизиты.ВидОперации = рарусПриходТМЦ.ВидОперацииЗакупкаПродуктовПитания()
		ИЛИ Реквизиты.ВидОперации = рарусПриходТМЦ.ВидОперацииЗакупкаНавигационныхКарт()
		ИЛИ Реквизиты.ВидОперации = рарусПриходТМЦ.ВидОперацииОприходованиеИзлишков());
	Запрос.УстановитьПараметр("ЭтоВидОперацииБезОбязательнойЗаявки", ЭтоВидОперацииБезОбязательнойЗаявки);
	//Запрос.УстановитьПараметр("ВидОперацииЗакупкаЧерезПодотчетноеЛицо", Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаЧерезПодотчетноеЛицо);
	// -- rarus atyutyakin 02.03.2021
	Запрос.УстановитьПараметр("РаспоряжениеНеЗаполнено", Не ЗначениеЗаполнено(Реквизиты.Распоряжение));
	Запрос.УстановитьПараметр("ОснованиеЗаполнено", ЗначениеЗаполнено(Реквизиты.ДокументОснование));
	Запрос.УстановитьПараметр("ОприходованиеБУ", Реквизиты.ОприходованиеБывшегоВУпотреблении);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	// ++ rarus atyutyakin 28.02.2021  [ФТ.ИМ.02.01]
	// Исключены движения по РН впТоварыНаСкладах
	//ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры);
	// -- rarus atyutyakin 28.02.2021
	ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
	
	// ++ rarus yukuzi 30.12.2020   // Снабжение ТОИР 2 Приоритет
	ТекстЗапросаТаблицарарусТоварыЗаявокНаСнабжение(Запрос, ТекстыЗапроса, Регистры);
	// -- rarus yukuzi 30.12.2020
	
	// ++ rarus makole 2021-01-21 [ФТ.ИМ.01.01]
	ПараметрыФОИмущественныйУчет = Новый Структура("Период, Судно", НачалоДня(Реквизиты.Дата), Реквизиты.Подразделение);
	Если рарусИмущественныйУчетСервер.ИспользоватьИмущественныйУчет(ПараметрыФОИмущественныйУчет) Тогда
		Запрос.УстановитьПараметр("Склад", рарусОбщегоНазначенияСервер.СкладСудна(Реквизиты.Подразделение));
		ТекстЗапросаТаблицаОтражениеДанныхИмущественногоУчета(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	// -- rarus makole 2021-01-21
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса);
	
КонецФункции

#КонецОбласти

Функция ПолучитьЗаявкиНаСнабжение(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Заявка КАК Заявка
	|ИЗ
	|	Документ.впПриходТМЦ.ТМЦ КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	МассивЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");
	
	рарусОбщегоНазначенияСМСервер.УдалитьНеЗаполненныеЭлементыМассива(МассивЗаявок);
	
	Возврат МассивЗаявок;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	рарусИмущественныйУчетСервер.ДобавитьКомандуСоздатьИзменениеСтатусаТМЦНаОснованииПриходТМЦ(КомандыСозданияНаОсновании);
	
	рарусИмущественныйУчетСервер.ДобавитьКомандуСоздатьРасходТМЦНаОснованииПриходТМЦ(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

// ++ rarus atyutyakin 28.02.2021  [ФТ.ИМ.02.01]
// Исключены движения по РН впТоварыНаСкладах
//Функция ТекстЗапросаТаблицаТоварыНаСкладах(Запрос, ТекстыЗапроса, Регистры)
//	
//	ИмяРегистра = "впТоварыНаСкладах";
//	
//	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	&Период КАК Период,
//	|	впПриходТМЦТМЦ.Ссылка.Подразделение КАК Судно,
//	|	впПриходТМЦТМЦ.Номенклатура КАК Номенклатура,
//	|	впПриходТМЦТМЦ.Количество КАК ВНаличии
//	|ИЗ
//	|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
//	|ГДЕ
//	|	впПриходТМЦТМЦ.Ссылка = &Ссылка";
//	
//	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
//	
//	Возврат ТекстЗапроса;
//	
//КонецФункции
// -- rarus atyutyakin 28.02.2021

Функция ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "впТоварыКПоступлению";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) 
		
		// ++ rarus PleA 22.12.2020 [26189]
		//ИЛИ НЕ Запрос.Параметры.РаспоряжениеЗаполнено 
		// -- rarus PleA
		
		Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	// ++ rarus PleA 28.12.2020 [26189]
	//ВидОперации = Запрос.Параметры.Ссылка.ВидОперации;
	//Если ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаЧерезПодотчетноеЛицо Тогда
	//	Возврат "";
	//КонецЕсли;
	// -- rarus PleA
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Распоряжение КАК Распоряжение,
	|	впПриходТМЦТМЦ.КодСтроки КАК КодСтроки,
	|	впПриходТМЦТМЦ.Ссылка.Подразделение КАК Судно,
	|	впПриходТМЦТМЦ.Номенклатура КАК Номенклатура,
	|	впПриходТМЦТМЦ.Заявка КАК Заявка,
	|	впПриходТМЦТМЦ.Количество КАК Количество
	|ИЗ
	|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
	|ГДЕ
	|	впПриходТМЦТМЦ.Ссылка = &Ссылка
	// ++ rarus atyutyakin 02.03.2021  [ФТ.ИМ.02.01]
	|	И НЕ &ЭтоВидОперацииБезОбязательнойЗаявки
	// -- rarus atyutyakin 02.03.2021
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	&Распоряжение КАК Распоряжение,
	|	впПриходТМЦТМЦ.КодСтроки,
	|	впПриходТМЦТМЦ.Ссылка.Подразделение,
	|	впПриходТМЦТМЦ.Номенклатура,
	|	впПриходТМЦТМЦ.Заявка,
	|	впПриходТМЦТМЦ.Количество
	|ИЗ
	|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
	|ГДЕ
	|	впПриходТМЦТМЦ.Ссылка = &Ссылка
	// ++ rarus atyutyakin 02.03.2021  [ФТ.ИМ.02.01]
	|	И НЕ &ЭтоВидОперацииБезОбязательнойЗаявки
	//|	И НЕ впПриходТМЦТМЦ.Ссылка.ВидОперации = &ВидОперацииЗакупкаЧерезПодотчетноеЛицо
	// -- rarus atyutyakin 02.03.2021
	|	И &РаспоряжениеНеЗаполнено";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ++ rarus yukuzi 30.12.2020   // Снабжение ТОИР 2 Приоритет
Функция ТекстЗапросаТаблицарарусТоварыЗаявокНаСнабжение(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "рарусТоварыЗаявокНаСнабжение";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	// ++ rarus yukuzi 12.01.2021   // Снабжение ТОИР 2 Приоритет 
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	впПриходТМЦТМЦ.Номенклатура КАК Номенклатура,
	|	впПриходТМЦТМЦ.Заявка КАК Заявка,
	|	впПриходТМЦТМЦ.Количество КАК Заказано
	|ИЗ
	|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
	|ГДЕ
	// ++ rarus atyutyakin 02.03.2021  [ФТ.ИМ.02.01]
	|	впПриходТМЦТМЦ.Ссылка = &Ссылка
	|	И НЕ &ЭтоВидОперацииБезОбязательнойЗаявки";
	//|	впПриходТМЦТМЦ.Ссылка = &Ссылка";
	// -- rarus atyutyakin 02.03.2021
	// -- rarus yukuzi 12.01.2021

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
// -- rarus yukuzi 30.12.2020

// ++ rarus makole 2021-01-21 [ФТ.ИМ.01.01]
// Добавить движение прихода по регистру накопления «Имущество на судах»
Функция ТекстЗапросаТаблицаОтражениеДанныхИмущественногоУчета(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "рарусИмуществоНаСудах";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА &ОприходованиеБУ
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.ОприходованоБУ)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.НаСкладе)
		|	КОНЕЦ КАК Статус,
		|	&Склад КАК Склад,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ТаблицаТоваров.Заявка <> ЗНАЧЕНИЕ(Документ.впЗаявкаНаСнабжение.ПустаяСсылка)
		|			ТОГДА ТаблицаТоваров.Заявка
		|		КОГДА НЕ &РаспоряжениеНеЗаполнено
		|			ТОГДА &Распоряжение
		|		КОГДА &ОснованиеЗаполнено
		|			ТОГДА &ДокументОснование
		|	КОНЕЦ КАК Распоряжение,
		|	ТаблицаТоваров.Ссылка.рарусКодСинхронизации КАК КодСинхронизации
		|ИЗ
		|	Документ.впПриходТМЦ.ТМЦ КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО (ТаблицаТоваров.Ссылка = &Ссылка)
		|			И ТаблицаТоваров.Номенклатура = спрНоменклатура.Ссылка
		|			И (спрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар))
		// ++ rarus makole 2021-07-26 [Задача № 29841]
		//|			И (спрНоменклатура.ЭтоТопливо = ЛОЖЬ)";
		|			И (спрНоменклатура.ЭтоТопливо = ЛОЖЬ
		|				И спрНоменклатура.ВидНоменклатуры.ЭтоТопливо = ЛОЖЬ)";
		// -- rarus makole 2021-07-26
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаТаблицаОтражениеДанныхИмущественногоУчета
// -- rarus makole 2021-01-21

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// ++ rarus yukuzi 15.02.2021   //ФТ.СНБ.02. Задача_Штрихкодирование
	Судно=vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	Если ЗначениеЗаполнено(Судно) тогда
		ПараметрыФО= Новый Структура("Период, Судно", ТекущаяДата(), Судно);
	иначе
		ПараметрыФО= Новый Структура("Период", ТекущаяДата());
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьШтрихкодирование",  ПараметрыФО) Тогда

	
		// Этикетки
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "ЭтикеткиОбщие";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки (общие этикетки  на позиции номенклатуры)';
		|en = 'Labels'");
		
		// Этикетки
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "ЭтикеткиОтдельные";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки (отдельные этикетки на каждую единицу номенклатуры)';
		|en = 'Labels'");

		
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "ЭтикеткиА4";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки (формат А4)';
		|en = 'Labels A4'");	
		
		// ++ rarus yukuzi 17.02.2021    // маленькие этикетки
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "Этикетки58х40";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки 58х40';
		|en = 'Labels 58х40'");
		
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "Этикетки58х40_А4";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки 58х40(формат А4)';
		|en = 'Labels 58х40 A4'");

		
		// -- rarus yukuzi 17.02.2021
		
		
	КонецЕсли;
	
	// -- rarus yukuzi 15.02.2021

КонецПроцедуры
// ++ rarus yukuzi 17.02.2021   // ФТ.СНБ.02. Задача_Штрихкодирование
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткиОбщие") Тогда
		ОтображатьКоличество=Истина;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткиОбщие",
		НСтр("ru = 'Этикетки (общие этикетки  на позиции номенклатуры)';
		|en = 'Labels'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(  ДанныеДляПечатиЭтикетки(МассивОбъектов, ОтображатьКоличество), "ОбщиеМакеты.ПФ_MXL_Этикетки", Истина, ОтображатьКоличество)
		//СформироватьПечатнуюФормуЭтикетка(МассивОбъектов, ОбъектыПечати, "Документ.впПриходТМЦ.ПФ_MXL_Этикетки128", Истина)
		,
		,
		"ОбщиеМакеты.ПФ_MXL_Этикетки"
		);
		
	КонецЕсли;	

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткиОтдельные") Тогда
		ОтображатьКоличество=Ложь;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткиОтдельные",
		НСтр("ru = 'Этикетки (отдельные этикетки на каждую единицу номенклатуры)';
		|en = 'Labels'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(  ДанныеДляПечатиЭтикетки(МассивОбъектов, ОтображатьКоличество), "ОбщиеМакеты.ПФ_MXL_Этикетки", Истина, ОтображатьКоличество)
		//СформироватьПечатнуюФормуЭтикетка(МассивОбъектов, ОбъектыПечати, "Документ.впПриходТМЦ.ПФ_MXL_Этикетки128", Истина)
		,
		,
		"ОбщиеМакеты.ПФ_MXL_Этикетки"
		);
		
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткиА4") Тогда
		 ОтображатьКоличество=Ложь;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткиА4",
		НСтр("ru = 'Этикетки';
		|en = 'Labels'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(   ДанныеДляПечатиЭтикетки(МассивОбъектов, ОтображатьКоличество), "Документ.впПриходТМЦ.ПФ_MXL_Этикетки")
		,
		,
		"Документ.впПриходТМЦ.ПФ_MXL_Этикетки"
		);
		
	КонецЕсли;		    		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Этикетки58х40_А4") Тогда
		 ОтображатьКоличество=Ложь;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Этикетки58х40_А4",
		НСтр("ru = 'Этикетки (58х40)';
		|en = 'Labels 58х40'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(   ДанныеДляПечатиЭтикетки(МассивОбъектов, ОтображатьКоличество), "Документ.впПриходТМЦ.ПФ_MXL_Этикетки58х40")
		,
		,
		"Документ.впПриходТМЦ.ПФ_MXL_Этикетки58х40"
		);
		
	КонецЕсли;		
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Этикетки58х40") Тогда
		ОтображатьКоличество=Ложь;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Этикетки58х40",
		НСтр("ru = 'Этикетки (58х40)';
		|en = 'Labels 58х40'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(   ДанныеДляПечатиЭтикетки(МассивОбъектов, ОтображатьКоличество), "Документ.впПриходТМЦ.ПФ_MXL_Этикетки58х40", Истина)
		,
		,
		"Документ.впПриходТМЦ.ПФ_MXL_Этикетки58х40"
		);
		
	КонецЕсли;		    	

КонецПроцедуры

Функция ДанныеДляПечатиЭтикетки(Ссылки, ОтображатьКоличество=Истина) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	впПриходТМЦТМЦ.Ссылка КАК Ссылка,
	|	впПриходТМЦТМЦ.Номенклатура КАК Номенклатура,
	|	впПриходТМЦТМЦ.Заявка КАК Заявка,
	|	впПриходТМЦТМЦ.Ссылка.Подразделение КАК Судно,
	|	впПриходТМЦТМЦ.Заявка.НомерСудовойЗаявки КАК ЗаявкаНомерСудовойЗаявки,
	|	впПриходТМЦТМЦ.Ссылка.Распоряжение КАК Распоряжение,
	|	впПриходТМЦТМЦ.Количество КАК Количество,
	|	впПриходТМЦТМЦ.Ссылка.Номер КАК Номер,
	|	впПриходТМЦТМЦ.Ссылка.Дата КАК Дата,
	|	впПриходТМЦТМЦ.Номенклатура.рспбКодMDG КАК КодMDG
	|ПОМЕСТИТЬ втДок
	|ИЗ
	|	Документ.впПриходТМЦ.ТМЦ КАК впПриходТМЦТМЦ
	|ГДЕ
	|	впПриходТМЦТМЦ.Ссылка В(&Ссылки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоКаталожныйНомер)
	|				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	|		КОНЕЦ) КАК ДопРекв_КаталожныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоМодель)
	|				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	|		КОНЕЦ) КАК ДопРекв_Модель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоПроизводитель)
	|				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	|		КОНЕЦ) КАК ДопРекв_Производитель,
	|	НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ втДопРеквизиты
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				втДок.Номенклатура КАК Номенклатура
	|			ИЗ
	|				втДок КАК втДок)
	|	И (НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоКаталожныйНомер)
	|			ИЛИ НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоМодель)
	|			ИЛИ НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоПроизводитель))
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(рарусШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	|	рарусШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втШК
	|ИЗ
	|	втДок КАК втДок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.рарусШтрихкодыНоменклатуры КАК рарусШтрихкодыНоменклатуры
	|		ПО втДок.Номенклатура = рарусШтрихкодыНоменклатуры.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	рарусШтрихкодыНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДок.Ссылка КАК Ссылка,
	|	втДок.Номенклатура КАК Номенклатура,
	|	втДок.Заявка КАК Заявка,
	|	втДок.Судно КАК Судно,
	|	ВЫРАЗИТЬ(втДок.Заявка КАК Документ.впЗаявкаНаСнабжение).Номер КАК НомерЗаявкиНаВнутреннееПотребление,
	|	ВЫРАЗИТЬ(втДок.Заявка КАК Документ.впЗаявкаНаСнабжение).НомерСудовойЗаявки КАК НомерСудовойЗаявки,
	|	ВЫРАЗИТЬ(втДок.Распоряжение КАК Документ.впЗаказПоставщику).Номер КАК НомерЗаказаПоставщику,
	|	ВЫБОР
	|		КОГДА &ОтображатьКоличество
	|			ТОГДА втДок.Количество
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ОтображатьКоличество
	|			ТОГДА втДок.Количество
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоПечати,
	|	втДок.Номер КАК Номер,
	|	втДок.Дата КАК Дата,
	|	втДок.КодMDG КАК КодMDG,
	|	ПРЕДСТАВЛЕНИЕ(втДок.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(втДок.Судно) КАК СудноПредставление,
	|	ЕСТЬNULL(втШК.Штрихкод, """") КАК Штрихкод,
	|	втДопРеквизиты.ДопРекв_КаталожныйНомер КАК НомерКаталога,
	|	втДопРеквизиты.ДопРекв_Модель КАК ОборудованиеПредставление,
	|	втДопРеквизиты.ДопРекв_Производитель КАК ПроизводительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(втДопРеквизиты.ВидНоменклатуры) КАК ТипОборудованияПредставление
	|ИЗ
	|	втДок КАК втДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ втШК КАК втШК
	|		ПО втДок.Номенклатура = втШК.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДопРеквизиты КАК втДопРеквизиты
	|		ПО втДок.Номенклатура = втДопРеквизиты.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Заявка");
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Запрос.УстановитьПараметр("ОтображатьКоличество", ОтображатьКоличество);

	рарусШтрихкодирование.ПараметрыЗапросаПоДопреквизитам(Запрос);
	
	УстановитьПривилегированныйРежим(Истина);
	//Возврат Запрос.Выполнить().Выбрать();
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// -- rarus yukuzi 17.02.2021

#КонецОбласти

// Добавляет команду создания документа "Изменение ассортимента".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
		
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
